In [80]:
#INSTANTIATE PANDAS
import pandas as pd

In [81]:
#INITIALIZE COLUMNS:
col1 = [1,2,2,2,1,None,2,None,None,None,None,None,None,None,8,9,10]
col2 = [10,21,22,22,None,None,2,None,None,None,None,None,None,None,81,92,102]
col3 = ["log","text","log","log",None,None,2,None,None,"text","text","log","log","csv","csv","csv","log"]
col4 = ["blue","green","red","red","blue","blue","blue","green",None,None,"blue","red","red","red","red","red","red"]
col5 = [10,21,22,22,None,None,2,None,None,None,None,None,None,None,81,92,102]

In [82]:
# CREATE DATAFRAME WITH THESE COLUMNS
df = pd.DataFrame({"first": col1, "second": col2, "third": col3, "fourth": col4, "fifth": col5})
df

    first  second third fourth  fifth
0     1.0    10.0   log   blue   10.0
1     2.0    21.0  text  green   21.0
2     2.0    22.0   log    red   22.0
3     2.0    22.0   log    red   22.0
4     1.0     NaN  None   blue    NaN
5     NaN     NaN  None   blue    NaN
6     2.0     2.0     2   blue    2.0
7     NaN     NaN  None  green    NaN
8     NaN     NaN  None   None    NaN
9     NaN     NaN  text   None    NaN
10    NaN     NaN  text   blue    NaN
11    NaN     NaN   log    red    NaN
12    NaN     NaN   log    red    NaN
13    NaN     NaN   csv    red    NaN
14    8.0    81.0   csv    red   81.0
15    9.0    92.0   csv    red   92.0
16   10.0   102.0   log    red  102.0

In [83]:
# SHOW FIRST 5 ROWS AND COLUMNS
df.iloc[0:5,0:5]

   first  second third fourth  fifth
0    1.0    10.0   log   blue   10.0
1    2.0    21.0  text  green   21.0
2    2.0    22.0   log    red   22.0
3    2.0    22.0   log    red   22.0
4    1.0     NaN  None   blue    NaN

In [84]:
# CREATE A NEW COLUMN
df["sixth"] = df["second"]*df["fifth"]
df.iloc[0:16,0:6]

    first  second third fourth  fifth   sixth
0     1.0    10.0   log   blue   10.0   100.0
1     2.0    21.0  text  green   21.0   441.0
2     2.0    22.0   log    red   22.0   484.0
3     2.0    22.0   log    red   22.0   484.0
4     1.0     NaN  None   blue    NaN     NaN
5     NaN     NaN  None   blue    NaN     NaN
6     2.0     2.0     2   blue    2.0     4.0
7     NaN     NaN  None  green    NaN     NaN
8     NaN     NaN  None   None    NaN     NaN
9     NaN     NaN  text   None    NaN     NaN
10    NaN     NaN  text   blue    NaN     NaN
11    NaN     NaN   log    red    NaN     NaN
12    NaN     NaN   log    red    NaN     NaN
13    NaN     NaN   csv    red    NaN     NaN
14    8.0    81.0   csv    red   81.0  6561.0
15    9.0    92.0   csv    red   92.0  8464.0

In [85]:
# FILL COL 1 FORWARD
df["first"] = df["first"].ffill()

# FILL COL 6 BACKWARD
df["sixth"] = df["sixth"].bfill()
df

    first  second third fourth  fifth    sixth
0     1.0    10.0   log   blue   10.0    100.0
1     2.0    21.0  text  green   21.0    441.0
2     2.0    22.0   log    red   22.0    484.0
3     2.0    22.0   log    red   22.0    484.0
4     1.0     NaN  None   blue    NaN      4.0
5     1.0     NaN  None   blue    NaN      4.0
6     2.0     2.0     2   blue    2.0      4.0
7     2.0     NaN  None  green    NaN   6561.0
8     2.0     NaN  None   None    NaN   6561.0
9     2.0     NaN  text   None    NaN   6561.0
10    2.0     NaN  text   blue    NaN   6561.0
11    2.0     NaN   log    red    NaN   6561.0
12    2.0     NaN   log    red    NaN   6561.0
13    2.0     NaN   csv    red    NaN   6561.0
14    8.0    81.0   csv    red   81.0   6561.0
15    9.0    92.0   csv    red   92.0   8464.0
16   10.0   102.0   log    red  102.0  10404.0

In [86]:
# ITERATE OVER SERIES AND DO SIMPLE REPLACEMENT
# PUSH THE NEW VALUES BACK INTO THE SERIES
new_vals = []
for i,t in df["second"].iteritems():
    if t == 2.0:
        t = 90.00
    new_vals.append(t)

df["second"] = new_vals
df

    first  second third fourth  fifth    sixth
0     1.0    10.0   log   blue   10.0    100.0
1     2.0    21.0  text  green   21.0    441.0
2     2.0    22.0   log    red   22.0    484.0
3     2.0    22.0   log    red   22.0    484.0
4     1.0     NaN  None   blue    NaN      4.0
5     1.0     NaN  None   blue    NaN      4.0
6     2.0    90.0     2   blue    2.0      4.0
7     2.0     NaN  None  green    NaN   6561.0
8     2.0     NaN  None   None    NaN   6561.0
9     2.0     NaN  text   None    NaN   6561.0
10    2.0     NaN  text   blue    NaN   6561.0
11    2.0     NaN   log    red    NaN   6561.0
12    2.0     NaN   log    red    NaN   6561.0
13    2.0     NaN   csv    red    NaN   6561.0
14    8.0    81.0   csv    red   81.0   6561.0
15    9.0    92.0   csv    red   92.0   8464.0
16   10.0   102.0   log    red  102.0  10404.0

In [87]:
# GRAB A SHORT SUBSET
df_subset_raw = df.iloc[0:4,0:6]
df_subset_raw

   first  second third fourth  fifth  sixth
0    1.0    10.0   log   blue   10.0  100.0
1    2.0    21.0  text  green   21.0  441.0
2    2.0    22.0   log    red   22.0  484.0
3    2.0    22.0   log    red   22.0  484.0

In [88]:
static = [ "first", "second", "fifth", "sixth" ]
df_subset_raw.melt(id_vars=static, var_name='attribute', value_name='values')

   first  second  fifth  sixth attribute values
0    1.0    10.0   10.0  100.0     third    log
1    2.0    21.0   21.0  441.0     third   text
2    2.0    22.0   22.0  484.0     third    log
3    2.0    22.0   22.0  484.0     third    log
4    1.0    10.0   10.0  100.0    fourth   blue
5    2.0    21.0   21.0  441.0    fourth  green
6    2.0    22.0   22.0  484.0    fourth    red
7    2.0    22.0   22.0  484.0    fourth    red